nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
/*
 *   HW ASSIGNMENT: GPGM0
 *   EEL-4746 Fall 2021
 *   Najeeb Eeso
 *   Date written: 9/19/21
 *   First EEL-4746 C Program
 */

// Standard Includes

#include "driverlib.h"
#include <stdint.h>
#include <stdio.h>
#include <eusci_b_i2c.h>
// files for BCUART functions
#include <stdbool.h>
#include "HAL_UART_4746.h"
#include <math.h>

//typedef enum {ONE,TWO,THREE,a,FOUR,FIVE,SIX,b,SEVEN,EIGHT,NINE,c,ASTREK,ZERO,POUND,d,NONE} Tones;
typedef enum {ZERO, ONE, TWO, THREE, FOUR, FIVE, SIX, SEVEN, EIGHT, NINE, a, b, c, d, ASTREK, POUND, NONE} Tones;
Tones tone;

void GPIO_init(void);
void initI2C(void);
void initializeADC(void);
void initializeUART(void);
void I2C_write_16(uint8_t, uint8_t, uint16_t);
void I2C_write_8(uint8_t, uint8_t, uint8_t);
void genCos(uint16_t, uint16_t, uint16_t, double*);
uint8_t double2ADC(double);
uint16_t I2C_read_16(uint8_t, uint8_t);
uint8_t I2C_read_8(uint8_t, uint8_t);
uint8_t testADC(void);


volatile uint16_t ADCCounter = 0;
uint8_t savedSpeakerValues[128];
uint8_t SLAVE_ADDRESS = 0x3c;   //define the slave address




/*I2C Register Map */
    const uint8_t SLAVE_REG = 0x00;             // the slave address of the I2C device
    const uint8_t MANUID_REG = 0x02;            // the manufacturing ID of the I2C device
    const uint8_t DEVICE_ID_REG = 0x04;         // the device ID of the I2C device
    const uint8_t COMMAND_REG = 0x06;           // the command register that the msp writes to
    const uint8_t STATUS_REG = 0x08;            // the status register that the msp reads from
    const uint8_t RESULTS_REG = 0x0A;           // the register containing value of the result given from the FPGA
    const uint8_t IN_SAMPLE_REG = 0x0C;         // the register the input sample gets written to
    const uint8_t THRESHOLD_REG = 0x0E;         // the address of the register of that controls the threshold used in the tone detector module
/* END I2C Register Map */

/*I2C COMMAND_REG Bit Definitions */
    const uint16_t MSP_BIT0 = 0;
    const uint16_t MSP_BIT1 = 1;         //set: tells FPGA to wait, reset: data is sent and FPGA is ready
    const uint16_t MSP_BIT2 = 2;         //set: data has been read, reset: data has not been read
    const uint16_t MSP_BIT3 = 3;         //set: resets the FPGA, reset: enables the FPGA
/* END COMMAND_REG Bit Definitions */

/*I2C STATUS_REG Bit Definitions */
    const uint16_t FPGA_BIT0 = 0;     //set: output is valid, reset: output is invalid
    const uint16_t FPGA_BIT1 = 1;          //set: FPGA is busy, reset: FPGA is not busy
    const uint16_t FPGA_BIT2 = 2;    //set: FPGA is in input mode (wants inputs), reset: FPGA in output mode (calculating outputs)
    const uint16_t FPGA_BIT3 = 3;   //set: FPGA wants an input, reset: FPGA does not want an input
/* END STATUS_REG Bit Definitions */

//  Main Function

void main(void){

    volatile uint8_t myRegValues[7] = {0, 0, 0, 0, 0, 0, 0, 0};
    // Define variables for light sensor

    // Halt the WatchDog Timer
    WDT_A_hold(WDT_A_BASE);

    // Activate new port configurations and put all GPIO low (LOW POWER), pin 1.3 as ADC input
    GPIO_init();

    // Initialize I2C port
    initI2C();

    // initialize ADC with 10KHz sampling rate at 8 bits per sample, start continious conversions
    initializeADC();

    initializeUART();
//    Tones incrementer = ONE;
//    uint16_t speakerValueListMod[128] = {0x0000, 0x7100, 0x4500, 0xE000, 0xDC00, 0x0100, 0xDD00, 0xBB00, 0x1100, 0x7900, 0x4700, 0xBD00, 0xA300, 0xF700, 0x1700, 0xF500, 0x1000, 0x5700, 0x2F00, 0xA900, 0x8B00, 0x0200, 0x5400, 0x2500, 0xF800, 0x1800, 0x1100, 0xB500, 0x9C00, 0x1600, 0x7A00, 0x3B00, 0xD000, 0xD200, 0xFF00, 0xE300, 0xCA00, 0x2000, 0x7800, 0x3400, 0xAA00, 0xA100, 0x0200, 0x2400, 0xFF00, 0x1400, 0x4E00, 0x1C00, 0x9D00, 0x9400, 0x1600, 0x6000, 0x2300, 0xEF00, 0x0B00, 0x0500, 0xB400, 0xAC00, 0x2A00, 0x7E00, 0x2D00, 0xBF00, 0xCB00, 0x0100, 0xEC00, 0xD900, 0x2C00, 0x7300, 0x1F00, 0x9A00, 0xA400, 0x1100, 0x3100, 0x0500, 0x1300, 0x4200, 0x0900, 0x9500, 0xA100, 0x2B00, 0x6900, 0x1D00, 0xE300, 0x0000, 0xFD00, 0xB700, 0xBE00, 0x3C00, 0x7E00, 0x1B00, 0xAE00, 0xC700, 0x0700, 0xF700, 0xE700, 0x3400, 0x6900, 0x0900, 0x8E00, 0xAB00, 0x2200, 0x3D00, 0x0800, 0x0E00, 0x3400, 0xF900, 0x9200, 0xB200, 0x4000, 0x6E00, 0x1200, 0xD500, 0xF600, 0xF900, 0xBE00, 0xD100, 0x4B00, 0x7900, 0x0700, 0x9F00, 0xC700, 0x1000, 0x0300, 0xF300, 0x3700, 0x5C00, 0xF400, 0x8500, };
//
//    while(incrementer < NONE){
//        /* obtain 128 samples, store in list, convert the list to 16 bits each (mimics ADC interrupt)*/
//        volatile uint8_t speakerValueList[128];
//        volatile uint16_t speakerValueList16[128];
//        getMicValues128(incrementer, speakerValueList); //get 8 bit ADC values (what would come out of the interrupt of mic)
//        listConvert8to16(speakerValueList, speakerValueList16); //convert all data to 16 bits with imagionary part set to 0x00
//        uint8_t counter = 0;
//
//        /* end ADC mimic*/
//        volatile uint8_t value;
//
//
//
//
//        volatile Tones toneResult = NONE;
//        volatile uint16_t toneHex;
//
//        //I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, 0x5688);
//        //I2C_read_16(0x44,0x7E);
//        //I2C_read_8(SLAVE_ADDRESS,COMMAND_REG);
//
//        toneResult = asicDecode(speakerValueList16);
//
//        tonePrinter(toneResult);
//        incrementer++;
//    }

    volatile Tones toneResult = NONE;
    volatile uint16_t speakerValueList16[128];

    I2C_write_16(SLAVE_ADDRESS, THRESHOLD_REG, 300);// write into threshold register

    __enable_interrupt();

    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN3);   //PBS1
    GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN2);

    Tones prevTone=NONE;
    Tones password[4]={ONE, THREE, NINE, d};
    volatile Tones userEnteredPassword[4]={NONE,NONE,NONE,NONE};
    uint8_t toneCount=0;
    volatile bool pwValid=false;
    bool oneToneDetected=false;
    while(1){

        //when 128 samples are picked up by ADC ISR, disable the ISR, convert the 128 list to 16 bits, adding 0's to the imagionary part, perform asicDecode, print the tone result,
        //reset sample counter, and re-enable ADC ISR
        if (ADCCounter > 127){

