nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
            __disable_interrupt();
//            volatile uint8_t myRegASICStatusmsb,myRegASICStatuslsb,myRegMCUStatusmsb,myRegMCUStatuslsb;
//                    myRegASICStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x08);
//                    myRegASICStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x09);
//                    myRegMCUStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x06);
//                    myRegMCUStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x07);
            listConvert8to16(savedSpeakerValues, speakerValueList16);
            toneResult = asicDecode(speakerValueList16);
            tonePrinter(toneResult);
//            if(GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN2)!=0){
//                userEnteredPassword[0] = NONE;
//                userEnteredPassword[1] = NONE;
//                userEnteredPassword[2] = NONE;
//                userEnteredPassword[3] = NONE;
//                toneCount = 0;
//            }
            ledStatus(toneCount);
            if((toneResult!=prevTone)&&(toneResult!=NONE)&&oneToneDetected!=true){
                oneToneDetected=true;
                //prevTone=toneResult;
            }else if(toneResult==prevTone&&oneToneDetected==true){
                if(toneResult==NONE){
                    oneToneDetected=false;
                }else{
                    //UPDATE AND DISPLAY HOW MANY TONES ARE IN userEnteredPassword so far
                    oneToneDetected=false;
                    userEnteredPassword[toneCount]=toneResult;
                    toneCount++;
                    ledStatus(toneCount);
                    if(toneCount==4){
                        toneCount=0;
                        if((userEnteredPassword[0]==password[0])&&(userEnteredPassword[1]==password[1])&&(userEnteredPassword[2]==password[2])&&(userEnteredPassword[3]==password[3])){
                            pwValid=true;//set door unlock signal high
                            GPIO_setOutputLowOnPin(GPIO_PORT_P1,GPIO_PIN2);
                            while(GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN3)!=0);
                            //userEnteredPassword[0]={NONE,NONE,NONE,NONE};
                            pwValid=false;//set door unlock signal low
                            GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN2);
                        }else{
                            pwValid=false;
                            GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN2);
                            userEnteredPassword[0] = NONE;
                            userEnteredPassword[1] = NONE;
                            userEnteredPassword[2] = NONE;
                            userEnteredPassword[3] = NONE;
                        }
                    }
                }
            }//else if(toneResult!=prevTone){
                //prevTone=toneResult;

            //}
            //oneToneDetected=false;
            prevTone=toneResult;
            //GPIO_toggleOutputOnPin(GPIO_PORT_P3, GPIO_PIN1);
            ADCCounter = 0;
            __enable_interrupt();
        }



    }








}
//
//
//
//
//
//        /*if the FPGA is in input mode, and is read for an input, send an input through I2C, until FPGA is in output mode*/
//        uint16_t reg_value;
//        uint8_t data_list_index = 0;
//
//        do{
//            reg_value = I2C_read_16(SLAVE_ADDRESS, STATUS_REG);
//            if(((reg_value & INPUT_READY_FLAG) > 0)){
//                I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, speakerValueList16[data_list_index]);
//                data_list_index++;
//            }
//        } while((reg_value & INPUT_MODE_FLAG) > 0);
//
//        /*end sending of data*/
//
//        /* wait until valid data is produced by the FPGA and read the result*/
//        uint16_t finalResult;
//        volatile Tones finalTone;
//        while(!(I2C_read_16(SLAVE_ADDRESS, STATUS_REG) & OUT_VALID_FLAG));
//        finalResult = I2C_read_16(SLAVE_ADDRESS, RESULTS_REG);
//        finalTone = toneDecoder(finalResult);   //make sure decoder matches FPGA
        /* end wait */
//}
    /*end main loop*/

    //enable global interrupts
    //__enable_interrupt();

//    //set both pushbuttons as inputs with pull up resistors
//    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN3);   //PBS1
//    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN2);   //PBS2
//
//    uint8_t PBS1;
//    uint8_t PBS2;
//
//    while(1){
//        PBS1 = GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN3);
//        PBS2 = GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN2);
//        if(PBS1 == GPIO_INPUT_PIN_LOW){
//            GPIO_setOutputLowOnPin(GPIO_PORT_P1,GPIO_PIN0);
//            GPIO_setOutputLowOnPin(GPIO_PORT_P1,GPIO_PIN2);
//        }
//        else if(PBS2 == GPIO_INPUT_PIN_LOW){
//            GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN0);
//            GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN2);
//        }
//    }


//    uint8_t i=0;
//    char buffer[100];
//
//    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN3);   //PBS1
//    uint8_t PBS1;
//    while(1){
//        PBS1 = GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN3);
//        if(PBS1 == GPIO_INPUT_PIN_LOW){
//            __delay_cycles(10000000);
//            ADCCounter = 0;
//            i=0;
//        }
//        else if(ADCCounter >= 128){
//            for(; i<128; i++){
//                sprintf(buffer,"%x00 \r\n",savedSpeakerValues[i]);
//                            UART_transmitString(buffer);
//
//            }
//            if (i==128) {
//                sprintf(buffer,"\r\n\r\n\r\n");
//                                        UART_transmitString(buffer);
//                i++;
//            }
//        }
//    }

//}


/*
    Author: Najeeb Eeso
*/

#pragma vector=ADC12_VECTOR
__interrupt void ADC12_ISR(void)
{
//    char buffer[100];
////    volatile uint8_t value = testADC(); //used to functionally test ADC. set breakpoint here to validate output of ADC if testing
////    GPIO_toggleOutputOnPin(GPIO_PORT_P3, GPIO_PIN1);    //used to test the frequency of the ADC by toggling a GPIO pin
//
    if (ADCCounter < 128){
        savedSpeakerValues[ADCCounter] = ADC12_B_getResults(ADC12_B_BASE, ADC12_B_MEMORY_0);
        ADCCounter++;
    }


//
//        ADCCounter = ADCCounter+1;
    //volatile uint16_t answer = ADC12_B_getResults(ADC12_B_BASE, ADC12_B_MEMORY_0);

    //clear the ADC interrupt
    ADC12_B_clearInterrupt(ADC12_B_BASE,0,ADC12_B_IFG0);
}




