nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
Tones asicDecode(uint16_t samples[128]){

//    const uint8_t SLAVE_REG = 0x00;             // the slave address of the I2C device
//    const uint8_t MANUID_REG = 0x02;            // the manufacturing ID of the I2C device
//    const uint8_t DEVICE_ID_REG = 0x04;         // the device ID of the I2C device
//    const uint8_t COMMAND_REG = 0x06;           // the command register that the msp writes to
//    const uint8_t STATUS_REG = 0x08;            // the status register that the msp reads from
//    const uint8_t RESULTS_REG = 0x0A;           // the register containing value of the result given from the FPGA
//    const uint8_t IN_SAMPLE_REG = 0x0C;         // the register the input sample gets written to
        volatile uint8_t myRegASICStatusmsb,myRegASICStatuslsb,myRegMCUStatusmsb,myRegMCUStatuslsb;
        myRegASICStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x08);
        myRegASICStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x09);
        myRegMCUStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x06);
        myRegMCUStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x07);

        Tones outputTone = NONE;

        volatile uint16_t command_reg_data = 0x0000;
        uint8_t sampleIndex = 0x00;

        //initialize msp status register
        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);
        myRegASICStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x08);
        myRegASICStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x09);
        myRegMCUStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x06);
        myRegMCUStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x07);
        //initialize sample in status register
        I2C_write_16(SLAVE_ADDRESS, IN_SAMPLE_REG, 0x0000);
        myRegASICStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x08);
        myRegASICStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x09);
        myRegMCUStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x06);
        myRegMCUStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x07);
        //
        set2Bits(&command_reg_data, MSP_BIT0, MSP_BIT1);
        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);
        myRegASICStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x08);
        myRegASICStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x09);
        myRegMCUStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x06);
        myRegMCUStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x07);

        //poll ASIC to see when enters input mode, if input mode, move on
        while(!readBit(STATUS_REG,FPGA_BIT2));


        uint16_t FPGASampleCounter, MCUSampleCounter = 0x00;

        //send the data to the ASIC when it is ready
        for(sampleIndex=0x00;sampleIndex<128;sampleIndex++){

            I2C_write_16(SLAVE_ADDRESS, IN_SAMPLE_REG, samples[sampleIndex]);   //send 1 peice of data

            if(sampleIndex<127){

                //wait for FPGA to be ready for next sample
                do{

                    FPGASampleCounter = (I2C_read_16(SLAVE_ADDRESS, STATUS_REG) >> 8);  //this is supposed to sample MSB[6..0]
                    MCUSampleCounter = (command_reg_data >> 8);     //this never gets updated in loop, think about removing

                }while(FPGASampleCounter != (MCUSampleCounter+1));

                //increment MSB bits [6..0] for MCU status
                MCUSampleCounter = MCUSampleCounter + 1;
                command_reg_data &= ~(0xff00);
                command_reg_data = (MCUSampleCounter << 8) | command_reg_data;
                I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);


            }

        }

        //MCU status is that it is not longer in input mode
        reset1Bit(&command_reg_data, MSP_BIT1);
        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);

        //wait for tone detector to finish
        while(!readBit(STATUS_REG,FPGA_BIT0));

        //read off the output and store it
        outputTone = I2C_read_16(SLAVE_ADDRESS, RESULTS_REG);

        //reset all MSP register to initial state of 0x0000
        command_reg_data = 0x0000;
        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);

        //tell the FPGA that the output has been read, and the FPGA can reset
        set1Bit(&command_reg_data, MSP_BIT2);
        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);

        return outputTone;

}

void ledStatus(uint8_t toneCount){
    if(toneCount == 0){
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN6);    //state of LEDRED
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN5);    //state of LEDGREEN
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN4);    //state of LEDBLUE
    }
    else if(toneCount == 1){
        GPIO_setOutputHighOnPin(GPIO_PORT_P3,GPIO_PIN6);    //state of LEDRED
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN5);    //state of LEDGREEN
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN4);    //state of LEDBLUE
    }
    else if(toneCount == 2){
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN6);    //state of LEDRED
        GPIO_setOutputHighOnPin(GPIO_PORT_P3,GPIO_PIN5);    //state of LEDGREEN
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN4);    //state of LEDBLUE
    }
    else if(toneCount == 3){
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN6);    //state of LEDRED
        GPIO_setOutputLowOnPin(GPIO_PORT_P3,GPIO_PIN5);    //state of LEDGREEN
        GPIO_setOutputHighOnPin(GPIO_PORT_P3,GPIO_PIN4);    //state of LEDBLUE
    }
    else{
        GPIO_setOutputHighOnPin(GPIO_PORT_P3,GPIO_PIN6);    //state of LEDRED
        GPIO_setOutputHighOnPin(GPIO_PORT_P3,GPIO_PIN5);    //state of LEDGREEN
        GPIO_setOutputHighOnPin(GPIO_PORT_P3,GPIO_PIN4);    //state of LEDBLUE
    }
}

void statusRead(uint8_t *myRegASICStatusmsb, uint8_t *myRegASICStatuslsb,uint8_t *myRegMCUStatusmsb,uint8_t *myRegMCUStatuslsb){
    *myRegASICStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x08);
    *myRegASICStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x09);
    *myRegMCUStatusmsb = I2C_read_8(SLAVE_ADDRESS, 0x06);
    *myRegMCUStatuslsb = I2C_read_8(SLAVE_ADDRESS, 0x07);
}


/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

bool readBit(uint16_t registerAddress, uint16_t bitPosition){
    uint16_t bitSelecter = 0x0001 << bitPosition;
    uint16_t readValue = I2C_read_16(SLAVE_ADDRESS, registerAddress) & bitSelecter;
    if (readValue > 0) return true;
    else return false;
}

void set1Bit(uint16_t *registerValue, uint8_t bitPosition){
    uint16_t bitSelecter = 0x0001 << bitPosition;
    *registerValue |= bitSelecter;
}

void set2Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2);
    *registerValue |= bitSelecter;
}

void set3Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2, uint8_t bitPosition3){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2) | (0x0001 << bitPosition3);
    *registerValue |= bitSelecter;
}

void reset1Bit(uint16_t *registerValue, uint8_t bitPosition){
    uint16_t bitSelecter = 0x0001 << bitPosition;
    *registerValue &= ~bitSelecter;
}

void reset2Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2);
    *registerValue &= ~bitSelecter;
}

