nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
void reset3Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2, uint8_t bitPosition3){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2) | (0x0001 << bitPosition3);
    *registerValue &= ~bitSelecter;
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

void getMicValues128(Tones tone, uint8_t values[128]){
    double speakerAnalogValue;
    uint8_t sample;
    for(sample=0; sample<128; sample++){
        genToneSin(tone,sample,&speakerAnalogValue);
        values[sample] = double2ADC(speakerAnalogValue)-0x7f;
    }
}


/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

void listConvert8to16(uint8_t values8[128], uint16_t values16[128]){
    uint8_t sample;
    for(sample=0; sample<128; sample++){
        values16[sample] = (values8[sample] << 8) & (0xFF00);
    }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

Tones toneDecoder(uint16_t result){
    switch(result){
            case 0x0000: return ZERO;
            case 0x0001: return ONE;
            case 0x0002: return TWO;
            case 0x0003: return THREE;
            case 0x0004: return FOUR;
            case 0x0005: return FIVE;
            case 0x0006: return SIX;
            case 0x0007: return SEVEN;
            case 0x0008: return EIGHT;
            case 0x0009: return NINE;
            case 0x000A: return ASTREK;
            case 0x000B: return POUND;
            case 0x000C: return a;
            case 0x000D: return b;
            case 0x000E: return c;
            case 0x000F: return d;
            default: return NONE;
        }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

void tonePrinter(Tones tone){
    uint8_t buffer[100];

    switch(tone){
    case ONE:
        sprintf(buffer,"%s","Tone is ONE\r\n");
                    UART_transmitString(buffer); break;
    case TWO:
        sprintf(buffer,"%s","Tone is TWO\r\n");
                    UART_transmitString(buffer); break;
    case THREE:
        sprintf(buffer,"%s","Tone is THREE\r\n");
                    UART_transmitString(buffer); break;
    case a:
        sprintf(buffer,"%s","Tone is A\r\n");
                    UART_transmitString(buffer); break;
    case FOUR:
        sprintf(buffer,"%s","Tone is FOUR\r\n");
                    UART_transmitString(buffer); break;
    case FIVE:
        sprintf(buffer,"%s","Tone is FIVE\r\n");
                    UART_transmitString(buffer); break;
    case SIX:
        sprintf(buffer,"%s","Tone is SIX\r\n");
                    UART_transmitString(buffer); break;
    case b:
        sprintf(buffer,"%s","Tone is B\r\n");
                    UART_transmitString(buffer); break;
    case SEVEN:
        sprintf(buffer,"%s","Tone is SEVEN\r\n");
                    UART_transmitString(buffer); break;
    case EIGHT:
        sprintf(buffer,"%s","Tone is EIGHT\r\n");
                    UART_transmitString(buffer); break;
    case NINE:
        sprintf(buffer,"%s","Tone is NINE\r\n");
                    UART_transmitString(buffer); break;
    case c:
        sprintf(buffer,"%s","Tone is C\r\n");
                    UART_transmitString(buffer); break;
    case ASTREK:
        sprintf(buffer,"%s","Tone is *\r\n");
                    UART_transmitString(buffer); break;
    case ZERO:
        sprintf(buffer,"%s","Tone is ZERO\r\n");
                    UART_transmitString(buffer); break;
    case POUND:
        sprintf(buffer,"%s","Tone is #\r\n");
                    UART_transmitString(buffer); break;
    case d:
        sprintf(buffer,"%s","Tone is D\r\n");
                    UART_transmitString(buffer); break;
    case NONE:
        sprintf(buffer,"%s","Tone is NONE\r\n");
                    UART_transmitString(buffer); break;
        }
}


/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to generate a single cos, simulating the voltage that the ADC would get.
*/

void debugReg(uint8_t myRegValues[7]){
    uint8_t i = 0;
    volatile uint8_t dummy;
    for(; i<8; i++){
        dummy = I2C_read_8(SLAVE_ADDRESS, i);
        myRegValues[i] = dummy;
    }
}

void genCos(uint16_t f, uint16_t fs, uint16_t sample, double* result ){
    double y = 1.65*(cos(2*M_PI*f*sample/fs)+1);
    *result = y;
}

void genSin(uint16_t f, uint16_t fs, uint16_t sample, double* result ){
    double y = 1.65*(sin(2*M_PI*f*sample/fs)+1);
    *result = y;
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to generate a combination of two cos, simulating the voltage that the ADC would get.
*/
void genCos2(uint16_t f1, uint16_t f2, uint16_t fs, uint16_t sample, double* result){
    //rowFreqLUT();
    double y = .825*(cos(2*M_PI*f1*sample/fs)+cos(2*M_PI*f2*sample/fs)+2);
    *result = y;
}

void genSin2(uint16_t f1, uint16_t f2, uint16_t fs, uint16_t sample, double* result){
    //rowFreqLUT();
    double y = .825*(sin(2*M_PI*f1*sample/fs)+sin(2*M_PI*f2*sample/fs)+2);
    *result = y;
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: outputs the row frequency of a dual tone.
*/
uint16_t rowFreqLUT(Tones tone){
    switch(tone){
        case ONE:
        case TWO:
        case THREE:
        case a:
            return 697;
        case FOUR:
        case FIVE:
        case SIX:
        case b:
            return 770;
        case SEVEN:
        case EIGHT:
        case NINE:
        case c:
            return 852;
        case ASTREK:
        case ZERO:
        case POUND:
        case d:
            return 941;

    }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: outputs the col frequency of a dual tone.
*/
uint16_t colFreqLUT(Tones tone){
    switch(tone){
        case ONE:
        case FOUR:
        case SEVEN:
        case ASTREK:
            return 1209;
        case TWO:
        case FIVE:
        case EIGHT:
        case ZERO:
            return 1336;
        case THREE:
        case SIX:
        case NINE:
        case POUND:
            return 1477;
        case a:
        case b:
        case c:
        case d:
            return 1633;

