nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
    }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to generate a combination of two cos of a dual tone, simulating the voltage that the ADC would get for each dual tone at the sampling rate.
*/
void genToneCos(Tones tone, uint16_t sample, double* result){
    uint16_t samplingFreq = 5000;
    genCos2(colFreqLUT(tone), rowFreqLUT(tone), samplingFreq, sample, result);
}

void genToneSin(Tones tone, uint16_t sample, double* result){
    uint16_t samplingFreq = 5000;
    genSin2(colFreqLUT(tone), rowFreqLUT(tone), samplingFreq, sample, result);
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to simulate an analog voltage going into an ADC, producing an 8 bit value
*/
uint8_t double2ADC(double value){
    volatile double vDiff = 3.3/255;
    volatile uint8_t result = floor(value/vDiff+.5);
    return result;
}


/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to test the functionality of the ADC. Reads memory address 0 and returns it.
*/

uint8_t testADC(void){
    return (uint8_t)(ADC12_B_getResults(ADC12_B_BASE,ADC12_B_MEMORY_0));

}



/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Initializes the ADC to 8 bit per sample with a 10KHz sampling rate and stores outputs in memory buffer 0.
                 The converter takes microphone analog input (A3 or pin P1.3) and converts it to digital output. To calculate
                 sampling frequency, the equation (X/Y)/(S*2+B)=10000 was used. X is the clock frequency to the ADC, Y is the overall divider,
                 S is the sample and hold clock value, and B is the bits per sample. For this, X=5MHz, Y=32, S=4 cycles, B=8 bits/sample.
    Test:
                 To test ADC function, make sure to change inputSourceSelect from ADC12_B_INPUT_A3 to ADC12_B_INPUT_A12. Then uncomment volatile uint8_t value = testADC();
                 Then setup a simple voltage divider, connecting the output to pin P3.0. Measure the voltage with a multimeter. The test measured voltage is 1.418V.
                 After running the testADC function, you should see a value that corresponds to the analog voltage to the pin. For the test measuremnt
                 voltage, the obtained value was decimal 110. To convert this obtained digital value to analog, multiply it by 3.3V (Full Scale Range) and divide by 2^8.
                 For the example, 110*3.3/2^8 = 1.41796V. Make sure __enable_interrupt(); is uncommented.

                 To test ADC frequency, uncomment GPIO_toggleOutputOnPin(GPIO_PORT_P3, GPIO_PIN1); Then connect the Digital Analyser to pin P3.1.
                 Everytime the interrupt happens, the pin is toggled (from high to low, or from low to high). Measure the high to low or low to high time and
                 obtain the ADC frequency.
*/
void initializeADC(void){


    //Initialize the ADC12B Module
        /*
        * Base address of ADC12B Module
        * Use internal ADC12B bit as sample/hold signal to start conversion
        * USE ACLK 5MHz Digital Oscillator as clock source
        * Use default clock divider/pre-divider of 32
        * Not use internal channel
        */
        ADC12_B_initParam initParam = {0};
        initParam.sampleHoldSignalSourceSelect = ADC12_B_SAMPLEHOLDSOURCE_SC;
        initParam.clockSourceSelect = ADC12_B_CLOCKSOURCE_ADC12OSC;
        initParam.clockSourceDivider = ADC12_B_CLOCKDIVIDER_1;
        initParam.clockSourcePredivider = ADC12_B_CLOCKPREDIVIDER__64;
        initParam.internalChannelMap = ADC12_B_NOINTCH;

        //initialize ADC with above parameters
        ADC12_B_init(ADC12_B_BASE, &initParam);

        //set the resolution of ADC to 8 bit
        ADC12_B_setResolution(ADC12_B_BASE, ADC12_B_RESOLUTION_8BIT);

        //Enable the ADC12B module
        ADC12_B_enable(ADC12_B_BASE);

        /*
        * Base address of ADC12B Module
        * For memory buffers 0-7 sample/hold for 4 clock cycles.
        * For memory buffers 8-15 sample/hold for 4 clock cycles (default)
        * Enable Multiple Sampling
        */
        ADC12_B_setupSamplingTimer(ADC12_B_BASE,
          ADC12_B_CYCLEHOLD_4_CYCLES,
          ADC12_B_CYCLEHOLD_4_CYCLES,
          ADC12_B_MULTIPLESAMPLESENABLE);

        //Configure Memory Buffer
        /*
        * Base address of the ADC12B Module
        * Configure memory buffer 0
        * Map input A12 to memory buffer 0
        * Vref+ = AVcc (3.3V)
        * Vref- = AVss (0V)
        * Memory buffer 0 is not the end of a sequence
        */
        // Microphone input
        ADC12_B_configureMemoryParam input = {0};
        input.memoryBufferControlIndex = ADC12_B_MEMORY_0;
        input.inputSourceSelect = ADC12_B_INPUT_A3;
        input.refVoltageSourceSelect = ADC12_B_VREFPOS_AVCC_VREFNEG_VSS;
        input.endOfSequence = ADC12_B_NOTENDOFSEQUENCE;
        input.windowComparatorSelect = ADC12_B_WINDOW_COMPARATOR_DISABLE;
        input.differentialModeSelect = ADC12_B_DIFFERENTIAL_MODE_DISABLE;
        ADC12_B_configureMemory(ADC12_B_BASE, &input);

        // Clear Interrupt
        ADC12_B_clearInterrupt(ADC12_B_BASE,0,ADC12_B_IFG0);

        //Enable memory buffer 0 interrupt
        ADC12_B_enableInterrupt(ADC12_B_BASE,ADC12_B_IE0,0,0);

        // start ADC conversion on repeated mode
        ADC12_B_startConversion(ADC12_B_BASE,ADC12_B_START_AT_ADC12MEM0,ADC12_B_REPEATED_SINGLECHANNEL);

    }


/*
    Author: Najeeb Eeso
    Inputs: slaveAddress: the 8 bit address of the device wanted to be communicated to
            regAddress: the 8 bit register address wanted to be read from
    Outputs: 8 bit register information
    Description: Reads 8 bit data to from a device through I2C. A start bit is sent, then an 8 bit address to select a slave device with write command, then an ack from a device, then
                 the register wanted to be read from, then an ack and a stop. Another Start is sent, with an 8 bit address to select a slave device with a read command. Then the 8 bit
                 content is sent from the slave to the master.
    Test: set a breakpoint at mId = I2C_read_8(0x44, 0x7E);. Connect pin P7.0 (SDA) to DIN 19 on the digital analyser. Connect pin P7.1 (SCL) to DIN 18
                 on the digital analyser. Open the default waveforms workspace I2C.dwf3work. Press single trigger mode and step over the breakpoint to view the waveforms. Ensure
                 that the communication protocol sent: <start> <0x44 Write> <ACK> <0x7E> <ACK> <STOP> <start> <0x44 Write> <ACK> <data> <NACK> <STOP>. The read data should be
                 0x54


*/
uint8_t I2C_read_8(uint8_t slaveAddress, uint8_t regAddress)
{
    volatile int8_t val = 0,temp;

