nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
    /* Set master to transmit mode PL */
    EUSCI_B_I2C_setMode(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_MODE);

    /* Clear any existing interrupt flag PL */
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);

    /* Wait until ready to write PL */
    while (EUSCI_B_I2C_isBusBusy(EUSCI_B2_BASE));

    /* Initiate start, send slave address, send register address */
    EUSCI_B_I2C_masterSendMultiByteStart(EUSCI_B2_BASE, regAddress);

    /* Send the data MSB first */
    EUSCI_B_I2C_masterSendMultiByteFinish(EUSCI_B2_BASE, (unsigned char)(data));

}

/*
    Author: Najeeb Eeso
    Inputs: slaveAddress: the 8 bit address of the device wanted to be communicated to
            regAddress: the 8 bit register address wanted to be written to
            data: the 16 bit data wanted to be stored in the register address
    Outputs: None
    Description: Writes 16 bit data to a device through I2C. A start bit is sent, then an 8 bit address to select a slave device, then an ack from a device, then
                 the register wanted to be written to, then an ack, then the 16 bit data followed by either an ack/nack and a stop command.
    Test:
                 set a breakpoint at I2C_write_16(SLAVE_ADDRESS, CONFIG_REG, DEFAULT_CONFIG_100); that configures the light detector on the boosterpack. Connect pin
                 P7.0 (SDA) to DIN 19 on the digital analyser. Connect pin P7.1 (SCL) to DIN 18 on the digital analyser. Open the default waveforms workspace
                 I2C.dwf3work. Press single trigger mode and step over the breakpoint to view the waveforms. Ensure that the
                 communication protocol sent: <start> <0x44 Write> <ACK> <0x01> <ACK> <0xC4> <ACK> <0x10> <ACK> <STOP>
*/
void I2C_write_16(uint8_t slaveAddress, uint8_t regAddress, uint16_t data)
{
    /* Specify slave address*/
    EUSCI_B_I2C_setSlaveAddress(EUSCI_B2_BASE, slaveAddress);
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,EUSCI_B_I2C_TRANSMIT_INTERRUPT0 + EUSCI_B_I2C_RECEIVE_INTERRUPT0);

    /* Set master to transmit mode PL */
    EUSCI_B_I2C_setMode(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_MODE);

    /* Clear any existing interrupt flag PL */
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);

    /* Wait until ready to write PL */
    while (EUSCI_B_I2C_isBusBusy(EUSCI_B2_BASE));

    /* Initiate start, send slave address, send register address */
    EUSCI_B_I2C_masterSendMultiByteStart(EUSCI_B2_BASE, regAddress);

    /* Send the data MSB first */
    EUSCI_B_I2C_masterSendMultiByteNext(EUSCI_B2_BASE, (unsigned char)(data>>8));

    EUSCI_B_I2C_masterSendMultiByteFinish(EUSCI_B2_BASE, (unsigned char)(data&0xFF));

}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Initializes the I2C module on pins P7.1 (SCL) and P7.0(SDA) for 400 KHz trannsmission rate
*/
void initI2C( void )
{

    //CS_initClockSignal(CS_SMCLK, CS_MODOSC_SELECT, CS_CLOCK_DIVIDER_2);

    //Set 7.1 and 7.0 as I2C output peripherals
    GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P7, GPIO_PIN0, GPIO_PRIMARY_MODULE_FUNCTION);
    GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P7, GPIO_PIN1, GPIO_PRIMARY_MODULE_FUNCTION);


    EUSCI_B_I2C_initMasterParam i2cParameters =
    {
     EUSCI_B_I2C_CLOCKSOURCE_SMCLK,          // SMCLK Clock Source
     14000000,                               // SMCLK = 1.00MHzMHz
     EUSCI_B_I2C_SET_DATA_RATE_400KBPS,      // Desired I2C Clock of 100khz

    };

    //disable I2C, initialize with parameters set above, enable I2C
    EUSCI_B_I2C_disable(EUSCI_B2_BASE);
    EUSCI_B_I2C_initMaster(EUSCI_B2_BASE, &i2cParameters);    //initialize with parameters
    EUSCI_B_I2C_enable(EUSCI_B2_BASE);  //enable i2c

}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/
void initializeUART( void )
{

    UART_initGPIO();
    UART_init();

}


/* Initializes GPIO as outputs low*/
void GPIO_init(){
    /* Terminate all GPIO pins to Output LOW to minimize power consumption */
    GPIO_setAsOutputPin(GPIO_PORT_PA, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PB, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PC, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PD, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PE, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PF, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PA, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PB, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PC, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PD, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PE, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PF, GPIO_PIN_ALL16);

    GPIO_setAsPeripheralModuleFunctionInputPin(
        GPIO_PORT_P3, GPIO_PIN0, GPIO_TERNARY_MODULE_FUNCTION);

    GPIO_setAsPeripheralModuleFunctionInputPin(
            GPIO_PORT_P1, GPIO_PIN3, GPIO_TERNARY_MODULE_FUNCTION);

    // Disable the GPIO power-on default high-impedance mode
    // to activate previously configured port settings
    PMM_unlockLPM5();
}



//    uint8_t i;
//    volatile int8_t data8;
//    uint8_t readInput4;
//
//    //code used to generate 20 samples of the 1 tone and transmit it to the FPGA
//    //and display values in 7 SEGMENT
//    for(i=0;i<=20; i++){
//
//        genToneSin(ONE, i, &answer);
//        data8 = double2ADC(answer);
//        data8 = data8-0x7f;

//        //        /* Set Default configuration for OPT3001*/
//                while(I2C_read_8(SLAVE_ADDRESS, 0x02) != 0x00);
//                //debugReg(myRegValues);
//                while(!(I2C_read_8(SLAVE_ADDRESS, 0x04)==0x00));
//                I2C_write_8(SLAVE_ADDRESS, 0x01,data8);    //set breakpoint here to test I2C_write_16
//                //debugReg(myRegValues);
//                I2C_write_8(SLAVE_ADDRESS, 0x02,0x01);
//                //debugReg(myRegValues);
//                while(!(I2C_read_8(SLAVE_ADDRESS, 0x04)==0x01));
//                I2C_write_8(SLAVE_ADDRESS, 0x02,0x00);
//                //debugReg(myRegValues);
               //__delay_cycles(1000000);
//    }

      //code used to generate 20 samples of a cos wave and transmit it to the FPGA
      //and display it on the 7 SEGMENT
//    for(i=0;i<=20; i++){
//
//        genCos(1000, 10000, i, &answer);
//        data8 = double2ADC(answer);
//
//        //        /* Set Default configuration for OPT3001*/
//                while(I2C_read_8(SLAVE_ADDRESS, 0x02) != 0x00);
//                //debugReg(myRegValues);
//                while(!(I2C_read_8(SLAVE_ADDRESS, 0x04)==0x00));
//                I2C_write_8(SLAVE_ADDRESS, 0x01,data8);    //set breakpoint here to test I2C_write_16
//                //debugReg(myRegValues);
//                I2C_write_8(SLAVE_ADDRESS, 0x02,0x01);
//                //debugReg(myRegValues);
//                while(!(I2C_read_8(SLAVE_ADDRESS, 0x04)==0x01));
//                I2C_write_8(SLAVE_ADDRESS, 0x02,0x00);
//                //debugReg(myRegValues);
//                __delay_cycles(1000000);
//    }


