nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
    //code used to transmit data to the FPGA
//    uint16_t data1 = 0xFF;
//    uint16_t data2 = 0xFF;
//
//    volatile uint16_t data16 = ((data1)<<8) | (data2);
//    volatile uint8_t data8 = 0xFF;
    /*For testing I2C_write_8 only*/
    //I2C_write_8(SLAVE_ADDRESS, 0x26, 0x00);   //uncomment and set breakpoint here to test I2C_write_8

    //OPT3001_init(0x44);
//    volatile uint8_t readInput4;

//    while(1){
//        /* Set Default configuration for OPT3001*/
//        //while(I2C_read_16(SLAVE_ADDRESS, 0x02) != 0x00);
//        debugReg(myRegValues);
//        readInput4 = I2C_read_8(SLAVE_ADDRESS, 0x04);
//        while(!(readInput4==0x00));
//        I2C_write_8(SLAVE_ADDRESS, 0x01,data8);    //set breakpoint here to test I2C_write_16
//        debugReg(myRegValues);
//        I2C_write_8(SLAVE_ADDRESS, 0x02,0x01);
//        debugReg(myRegValues);
//        readInput4 = I2C_read_8(SLAVE_ADDRESS, 0x04);
//        while(!(readInput4==0x01));
//        I2C_write_8(SLAVE_ADDRESS, 0x02,0x00);
//        debugReg(myRegValues);
//        //I2C_write_8(SLAVE_ADDRESS, 0x01,0x01);
//        //EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
//            //EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);
//        __delay_cycles(10000);
//        //I2C_read_8(0x3c,0x01);
//
//
//    }


    //Standard data packs: 156 samples collected, 156 samples will be given through I2C.
//    while(counter < 156){
//        genTone(ASTREK, counter, &answer);
//        savedSpeakerValues[counter] = double2ADC(answer);
//        counter = counter+1;
//    }




//mId = I2C_read_8(0x44, 0x7E);
//lightData = OPT3001_getLux(0x44);











/*ALEJANDRO CODE START*/
//    volatile uint16_t command_reg_data = 0x0000;
//    uint8_t data_index = 0x00;
//
//    //initialize msp status register
//    I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);
//
//    //initialize sample in status register
//    I2C_write_16(SLAVE_ADDRESS, IN_SAMPLE_REG, 0x0000);
//
//    /*main loop: collect 128 samples, send through I2C, wait until valid results are produced, read off the result register*/
//    while(1){
//        /* obtain 128 samples, store in list, convert the list to 16 bits each (mimics ADC interrupt)*/
//        volatile uint8_t speakerValueList[128];
//        volatile uint16_t speakerValueList16[128];
//        getMicValues128(ONE, speakerValueList); //get 8 bit ADC values (what would come out of the interrupt of mic)
//        listConvert8to16(speakerValueList, speakerValueList16); //convert all data to 16 bits with imagionary part set to 0x00
//        /* end ADC mimic*/
//
//        //set myRegMCUStatusLSB bit 3 to 1, MCU has collected the samples
//        set1Bit(command_reg_data,3);
//        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);
//
//        //poll asic status 0, while there is no valid tone, do the loop
//        while(!readBit(STATUS_REG,0)){
//
//            //perform loop if the samples have not all been transmitted
//
//            while(!readBit(STATUS_REG,1)){
//
//                //if asic is ready for input, send input
//                if(readBit(STATUS_REG,2)){
//                    I2C_write_16(SLAVE_ADDRESS, IN_SAMPLE_REG, speakerValueList16[data_index]); //send the input
//
//                    set2Bits(&command_reg_data, 0, 4);                                          // set bits 0 and 4
//                    I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);                 //send the new register data
//
//                    data_index++;                                                               //increment data index
//                }
//
//
//            }
//
//
//        }
//
//    }
/*ALEJANDRO CODE END*/
